CF/Enums/ТипыИнформационныхРассылок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхРассылок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EMail</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Documents/ИнформационнаяРассылка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ИнформационнаяРассылка</Name>
			<BasedOn>
				<xr:Item>Document.МаркетинговаяАкция</xr:Item>
				<xr:Item>Document.ИнформационнаяРассылка</xr:Item>
				<xr:Item>Document.НачислениеИСписаниеБонусныхБаллов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнформационнаяРассылка</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеИСписаниеБонусныхБаллов</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркетинговаяАкция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхРассылок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТранслите</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументаСообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Адресаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКонтакта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресEMailДляОтправки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДляОтправки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеСообщения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияСообщенияSMS</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/CommonModules/МаркетинговыеАкцииВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Передает управление по поиску серийных номеров
// одноименной функции модуля МаркетинговыеАкцииСервер.
//
// Параметры:
//  СтруктураПараметров - Структура параметров.
//  Текст   - введенный текст
//  СтандартнаяОбработка - Флаг стандартной обработки выбора. Здесь сбрасывается.
//
Функция ОбработатьВведенныйТекстСерийногоНомера(СтруктураПараметров, Текст, СтандартнаяОбработка) Экспорт
	
	Возврат МаркетинговыеАкцииСервер.ОбработатьВведенныйТекстСерийногоНомера(СтруктураПараметров, Текст, СтандартнаяОбработка);
	
КонецФункции

// Передает управление по заполнению приемника по данным подарочного сертификата
// одноименной функции модуля МаркетинговыеАкцииСервер.
//
// Параметры:
//  СерийныйНомер - серийный номер.
//
// Возвращаемое значение
//  Структура
//
Функция ПолучитьДанныеПодарочногоСертификата(СерийныйНомер) Экспорт

	Возврат МаркетинговыеАкцииСервер.ПолучитьДанныеПодарочногоСертификата(СерийныйНомер);

КонецФункции

Процедура НачатьРассылкуНефискальныхДокументов(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ОтправкаЭлектронныхЧековПослеПробитияЧека = Константы.ОтправкаЭлектронныхЧековПослеПробитияЧека.Получить();
	
	Для Каждого НефискальныйДокумент Из Параметры.НефискальныеДокументы Цикл
		ИтоговыйТекст = "";
		Для Каждого НефискальнаяСтрока ИЗ НефискальныйДокумент Цикл
			Если НефискальнаяСтрока.Свойство("ШтрихКод") И ЗначениеЗаполнено(НефискальнаяСтрока.ШтрихКод) Тогда
				ИтоговыйТекст = ИтоговыйТекст + НефискальнаяСтрока.ТипШтрихКода + ": " + НефискальнаяСтрока.ШтрихКод + Символы.ПС;
			ИначеЕсли НефискальнаяСтрока.Свойство("Текст") И ЗначениеЗаполнено(НефискальнаяСтрока.Текст) Тогда
				ИтоговыйТекст = ИтоговыйТекст + НефискальнаяСтрока.Текст + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
			
		ИтоговыйТекст = СокрЛП(ИтоговыйТекст);
		
		Если Параметры.Отправляет1СSMS Тогда
			СтрокаЦифровыхСимволов = "0123456789";
			НомерТелефонаТолькоЦифры = "";
			ДлинаНомера = СтрДлина(Параметры.ПокупательНомер);
			Для Индекс = 1 По ДлинаНомера Цикл
				Символ = Сред(Параметры.ПокупательНомер, Индекс, 1);
				Если СтрНайти(СтрокаЦифровыхСимволов, Символ) > 0 Тогда
					НомерТелефонаТолькоЦифры = НомерТелефонаТолькоЦифры + Символ;
				КонецЕсли;
			КонецЦикла;
			Рассылка = Документы.ИнформационнаяРассылка.СоздатьДокумент();
			Рассылка.Заполнить(Неопределено);
			Рассылка.Дата = ТекущаяДатаСеанса();
			Рассылка.УстановитьНовыйНомер();
			Рассылка.ТипРассылки = Перечисления.ТипыИнформационныхРассылок.SMS;
			Рассылка.ДокументОснование = Параметры.ДокументОснование;
			
			НоваяСтрока = Неопределено;
			НоваяСтрока = Рассылка.Адресаты.Добавить();
			НоваяСтрока.НомерТелефона = Параметры.ПокупательНомер;
			НоваяСтрока.НомерДляОтправки = НомерТелефонаТолькоЦифры;
			НоваяСтрока.ТекстСообщения = ИтоговыйТекст;
		
			Если ОтправкаЭлектронныхЧековПослеПробитияЧека Тогда
				МассивНомеров = Новый Массив;
				МассивНомеров.Добавить(НомерТелефонаТолькоЦифры);
				РезультатОтправки = ОтправкаSMS.ОтправитьSMS(МассивНомеров, ИтоговыйТекст, Неопределено, Ложь);
				
				Если РезультатОтправки.ОтправленныеСообщения.Количество() = 0 Тогда
					НоваяСтрока.ИдентификаторСообщения = "";
					НоваяСтрока.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.НеУдалосьПередатьПровайдеру;
					Рассылка.Состояние = Перечисления.СостоянияДокументаСообщениеSMS.НеДоставлено;
				Иначе	
					Для Каждого ОтправленноеСообщение Из РезультатОтправки.ОтправленныеСообщения Цикл
						НоваяСтрока.ИдентификаторСообщения = ОтправленноеСообщение.ИдентификаторСообщения;
						НоваяСтрока.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.ОтправляетсяПровайдером;
						Рассылка.Состояние = Перечисления.СостоянияДокументаСообщениеSMS.Доставляется;
					КонецЦикла;
				КонецЕсли;
				Если РезультатОтправки.Свойство("ОписаниеОшибки")
					И ЗначениеЗаполнено(РезультатОтправки.ОписаниеОшибки) Тогда
					НоваяСтрока.ТекстОшибки = РезультатОтправки.ОписаниеОшибки;
					НоваяСтрока.ИдентификаторСообщения = "";
					Если НЕ ЗначениеЗаполнено(НоваяСтрока.СостояниеСообщения) Тогда
						НоваяСтрока.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.НеУдалосьПередатьПровайдеру;
					КонецЕсли;
					Рассылка.Состояние = Перечисления.СостоянияДокументаСообщениеSMS.НеДоставлено;
				КонецЕсли;
			Иначе
				НоваяСтрока.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.ОтправляетсяПровайдером;
				
				ПараметрыСообщения = Новый Структура;
				ПараметрыСообщения.Вставить("НомерПолучателя", НомерТелефонаТолькоЦифры);
				ПараметрыСообщения.Вставить("ТекстСообщения" , ИтоговыйТекст);
				ПараметрыСообщенияХранилище = Новый ХранилищеЗначения(ПараметрыСообщения);
				
				ЭлементОбъект = Справочники.ОчередьЭлектронныхЧековКОтправке.СоздатьЭлемент();
				ЭлементОбъект.ТипРассылки  = Перечисления.ТипыРассылкиЭлектронныхЧеков.СообщениеSMS;
				ЭлементОбъект.Наименование = Параметры.ПокупательНомер;
				ЭлементОбъект.ПараметрыСообщения = ПараметрыСообщенияХранилище;
				ЭлементОбъект.ДатаПостановкиВОчередь = ТекущаяДатаСеанса();
				
				ЭлементОбъект.Записать();
			КонецЕсли;
			Рассылка.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		КонецЕсли;
		
		// Потом электронная почта.
		Если Параметры.Отправляет1СEmail Тогда
			
			Если НЕ ПустаяСтрока(ИтоговыйТекст) Тогда
				Рассылка = Документы.ИнформационнаяРассылка.СоздатьДокумент();
				Рассылка.Заполнить(Неопределено);
				Рассылка.Дата = ТекущаяДатаСеанса();
				Рассылка.УстановитьНовыйНомер();
				Тема = НСтр("ru = 'Квитанция к чеку №%1'");
				Тема = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Тема, Параметры.НомерЧека);
				Рассылка.Тема = Тема;
				Рассылка.ТипРассылки = Перечисления.ТипыИнформационныхРассылок.EMail;
				Рассылка.ДокументОснование = Параметры.ДокументОснование;
				
				НоваяСтрока = Рассылка.Адресаты.Добавить();
				НоваяСтрока.АдресEMailДляОтправки = Параметры.ПокупательEmail;
				НоваяСтрока.ТекстСообщения = ИтоговыйТекст;
				
				ПараметрыПисьма = Новый Структура;
				ПараметрыПисьма.Вставить("Кому", НоваяСтрока.АдресEMailДляОтправки);
				ПараметрыПисьма.Вставить("Тема", Тема);
				ПараметрыПисьма.Вставить("Тело", ИтоговыйТекст);
				Если ОтправкаЭлектронныхЧековПослеПробитияЧека Тогда
					Попытка
						УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
						ИдентификаторСообщения = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
						НоваяСтрока.ИдентификаторСообщения = ИдентификаторСообщения;
						НоваяСтрока.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.ОтправленоПровайдером;
						НоваяСтрока.ТекстОшибки = "";
						Рассылка.Состояние = Перечисления.СостоянияДокументаСообщениеSMS.Доставляется;
					Исключение
						НоваяСтрока.ТекстОшибки = ОписаниеОшибки();
						НоваяСтрока.ИдентификаторСообщения = "";
						НоваяСтрока.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.НеУдалосьПередатьПровайдеру;
						Рассылка.Состояние = Перечисления.СостоянияДокументаСообщениеSMS.НеДоставлено;
					КонецПопытки;
				Иначе
					НоваяСтрока.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.ОтправляетсяПровайдером;
					
					ПараметрыПисьмаХранилище = Новый ХранилищеЗначения(ПараметрыПисьма);
					
					ЭлементОбъект = Справочники.ОчередьЭлектронныхЧековКОтправке.СоздатьЭлемент();
					ЭлементОбъект.ТипРассылки  = Перечисления.ТипыРассылкиЭлектронныхЧеков.ЭлектронноеПисьмо;
					ЭлементОбъект.Наименование = НоваяСтрока.АдресEMailДляОтправки;
					ЭлементОбъект.ПараметрыСообщения = ПараметрыПисьмаХранилище;
					ЭлементОбъект.ДатаПостановкиВОчередь = ТекущаяДатаСеанса();
					
					ЭлементОбъект.Записать();
					
				КонецЕсли;
					
				Рассылка.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти
